raceway/CFD/0/UsNext
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UsNext;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    internal
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;//symmetryPlane;
    }
    sink
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
